<!-- 매드카우 루틴을 컨트롤하자 -->









매드카우 구조

필요한것
id, 1rm(스쿼트,벤치,밀리터리,데드,바벨로우)

5rm 공식 = 
1rm*(0.8888)*0.5

set*reps

1주차
1일
스쿼트 / 5x5 / 1rm*0.4444
벤치  / 5x5 / 1rm*0.4444
로우  / 5x5 / 1rm*0.4444

2일
스쿼트 / 5x5 / 1일차의 +2.5
프레스 / 5x5 / 1rm*0.4444
데드리프트 / 1x5 / 1rm*0.4444 

3일 
스쿼트 / 5x5 / 2일차의 + 2.5
벤치 / 5x5 / 1일차의 +2.5
로우 / 5x5 / 1일차의 +2.5


2주차

4일
스쿼트 / 5x5 / 3일차+2.5
프레스  / 5x5 / 2일차+2.5
데드리프트  / 1x5 / 2일차+5 

5일
스쿼트 / 5x5 / 4일차의 +2.5
벤치 / 5x5 / 3일차 + 2.5
로우 / 5x5 / 3일차 + 2.5 

6일 
스쿼트 / 5x5 / 5일차의 + 2.5
프레스 / 5x5 / 4일차의 +2.5
데드리프트 / 1x5 / 4일차의 +5


이후 반복

